{"keras_version": "1.1.2", "class_name": "Model", "config": {"output_layers": [["dense_3", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 40, 40, 3], "name": "input_1", "input_dtype": "float32"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "name": "convolution2d_1", "dim_ordering": "tf", "bias": true, "nb_filter": 32, "nb_col": 4, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_row": 4, "trainable": true, "activation": "linear", "W_constraint": null, "subsample": [2, 2], "activity_regularizer": null, "b_constraint": null}, "name": "convolution2d_1", "inbound_nodes": [[["input_1", 0, 0]]]}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_1", "trainable": true}, "name": "activation_1", "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"class_name": "Dropout", "config": {"p": 0.0625, "name": "dropout_1", "trainable": true}, "name": "dropout_1", "inbound_nodes": [[["activation_1", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "name": "convolution2d_2", "dim_ordering": "tf", "bias": true, "nb_filter": 64, "nb_col": 3, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_row": 3, "trainable": true, "activation": "linear", "W_constraint": null, "subsample": [2, 2], "activity_regularizer": null, "b_constraint": null}, "name": "convolution2d_2", "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_2", "trainable": true}, "name": "activation_2", "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"class_name": "Dropout", "config": {"p": 0.0625, "name": "dropout_2", "trainable": true}, "name": "dropout_2", "inbound_nodes": [[["activation_2", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "name": "convolution2d_3", "dim_ordering": "tf", "bias": true, "nb_filter": 128, "nb_col": 3, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_row": 3, "trainable": true, "activation": "linear", "W_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "b_constraint": null}, "name": "convolution2d_3", "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_3", "trainable": true}, "name": "activation_3", "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "name": "maxpooling2d_1", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "dim_ordering": "tf"}, "name": "maxpooling2d_1", "inbound_nodes": [[["activation_3", 0, 0]]]}, {"class_name": "Dropout", "config": {"p": 0.0625, "name": "dropout_3", "trainable": true}, "name": "dropout_3", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}, "name": "flatten_1", "inbound_nodes": [[["dropout_3", 0, 0]]]}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "bias": true, "activation": "linear", "input_dim": null, "b_regularizer": null, "output_dim": 512, "W_regularizer": null, "name": "dense_1", "trainable": true, "W_constraint": null, "activity_regularizer": null, "b_constraint": null}, "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0]]]}, {"class_name": "Dropout", "config": {"p": 0.0625, "name": "dropout_4", "trainable": true}, "name": "dropout_4", "inbound_nodes": [[["dense_1", 0, 0]]]}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_4", "trainable": true}, "name": "activation_4", "inbound_nodes": [[["dropout_4", 0, 0]]]}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "bias": true, "activation": "linear", "input_dim": null, "b_regularizer": null, "output_dim": 64, "W_regularizer": null, "name": "dense_2", "trainable": true, "W_constraint": null, "activity_regularizer": null, "b_constraint": null}, "name": "dense_2", "inbound_nodes": [[["activation_4", 0, 0]]]}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_5", "trainable": true}, "name": "activation_5", "inbound_nodes": [[["dense_2", 0, 0]]]}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "bias": true, "activation": "linear", "input_dim": null, "b_regularizer": null, "output_dim": 1, "W_regularizer": null, "name": "dense_3", "trainable": true, "W_constraint": null, "activity_regularizer": null, "b_constraint": null}, "name": "dense_3", "inbound_nodes": [[["activation_5", 0, 0]]]}], "name": "model_1"}}