____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to
====================================================================================================
input_1 (InputLayer)             (None, 40, 40, 3)     0
____________________________________________________________________________________________________
convolution2d_1 (Convolution2D)  (None, 19, 19, 32)    1568        input_1[0][0]
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 19, 19, 32)    0           convolution2d_1[0][0]
____________________________________________________________________________________________________
dropout_1 (Dropout)              (None, 19, 19, 32)    0           activation_1[0][0]
____________________________________________________________________________________________________
convolution2d_2 (Convolution2D)  (None, 9, 9, 64)      18496       dropout_1[0][0]
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 9, 9, 64)      0           convolution2d_2[0][0]
____________________________________________________________________________________________________
dropout_2 (Dropout)              (None, 9, 9, 64)      0           activation_2[0][0]
____________________________________________________________________________________________________
convolution2d_3 (Convolution2D)  (None, 7, 7, 128)     73856       dropout_2[0][0]
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 7, 7, 128)     0           convolution2d_3[0][0]
____________________________________________________________________________________________________
maxpooling2d_1 (MaxPooling2D)    (None, 3, 3, 128)     0           activation_3[0][0]
____________________________________________________________________________________________________
dropout_3 (Dropout)              (None, 3, 3, 128)     0           maxpooling2d_1[0][0]
____________________________________________________________________________________________________
flatten_1 (Flatten)              (None, 1152)          0           dropout_3[0][0]
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 512)           590336      flatten_1[0][0]
____________________________________________________________________________________________________
dropout_4 (Dropout)              (None, 512)           0           dense_1[0][0]
____________________________________________________________________________________________________
activation_4 (Activation)        (None, 512)           0           dropout_4[0][0]
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 64)            32832       activation_4[0][0]
____________________________________________________________________________________________________
activation_5 (Activation)        (None, 64)            0           dense_2[0][0]
____________________________________________________________________________________________________
dense_3 (Dense)                  (None, 1)             65          activation_5[0][0]
====================================================================================================
Total params: 717153
____________________________________________________________________________________________________
